# -*- coding: utf-8 -*-
'''
Story Config
============
'''

ASSET = {
        "PERSONS": (
            # (tag / name / full / age (birth) / job / call / info)
            ('yuji', 'ユージ', '', 35,(1,1), 'male', 'プログラマ', 'me:僕'),
            ('kieth', 'キース', '', 35,(1,1), 'male', '開発者', 'me:オレ'),
            ('ally', 'アリィ', '', 10,(1,1), 'female', '猫'),
            ('arisa', '有紗', '日陰,有紗', 35,(1,1), 'female', 'プログラマ', 'me:私'),
            ),
        "STAGES": (
            # (tag / name / parent / (geometry) / info)
            ),
        "DAYS": (
            # (tag / name / month / day / year)
            ),
        "TIMES": (
            # (tag / name / hour / minute)
            ),
        "ITEMS": (
            # (tag / name / cate / info)
            ),
        "WORDS": (
            # (tag / name / cate / info)
            ),
        "RUBIS": (
            # (origin / rubi / exclusions / always)
            ("有紗", "有紗《ありさ》"),
            ("雉色", "雉色《きじいろ》"),
            ("顎", "顎《あご》"),
            ("脛", "脛《すね》"),
            ("喉", "喉《のど》"),
            ("蟻", "蟻《あり》"),
            ("微塵", "微塵《みじん》"),
            ("頓挫", "頓挫《とんざ》"),
            ("所詮", "所詮《しょせん》"),
            ("厭な", "厭《いや》 な"),
            ("僅か", "僅《わず》か"),
            ("辟易", "辟易《へきえき》"),
            ("障([らりるれろっ])", "障《さわ》\\1"),
            ("唸([らりるれろっ])", "唸《うな》\\1"),
            ("纏([わいうえおっ])", "纏《まと》\\1"),
            ("溢れ", "溢《あふ》れ"),
            ("気怠([いくそ])", "気怠《けだる》\\1"),
            ),
        }

